"----------------------------------------------------------
"" タブ幅の設定
"----------------------------------------------------------
"tabを半角スペースに変換
set expandtab

"タブ幅をスペース4つで表示
set tabstop=4

"<Tab>キーで挿入されるインデント幅
set softtabstop=4

"自動的に挿入されるインデント幅
set shiftwidth=4

"自動でインデント挿入
set smartindent

"----------------------------------------------------------
" 検索の挙動に関する設定
"----------------------------------------------------------
"検索文字列が小文字の場合は大文字小文字を区別なく検索する
set ignorecase

"検索文字列に大文字が含まれている場合は区別して検索する
set smartcase

"検索時に最後まで行ったら最初に戻る
set wrapscan

"検索文字列入力時に順次対象文字列にヒットさせない
set noincsearch

"検索結果文字列のハイライトを有効にしない
set nohlsearch

"----------------------------------------------------------
" 表示に関する設定
"----------------------------------------------------------
"タイトル
set title

"タブの左側にカーソル表示
set nolist

"入力中のコマンドをステータスに表示する
set showcmd

"括弧入力時の対応する括弧を表示
set showmatch

"ステータスラインを常に表示
set laststatus=2

"----------------------------------------------------------
" コマンドに関する設定
"----------------------------------------------------------
",w でそのコマンドを保存
nmap ,w :w<CR>

",e でそのコマンドを保存実行
nmap ,e :w<CR>:execute '!' &ft ' %'<CR>

",p でpythonのシンタックスチェック
nmap ,c :w<CR>:!python -m py_compile %<CR>

"----------------------------------------------------------
" 文字コードに関する設定
"----------------------------------------------------------
"デフォルト文字コード
set encoding=utf-8
